import plyer
from colorama import Fore, Style, init
init(autoreset=True)

def run_app():
    work = input(Fore.YELLOW + "На сколько по времени погружаемся в роботу: ")
    chill = input(Fore.YELLOW + 'Сколько отдыхаем: ')
    name = 'user'

    while True:
    # сделаем так чтобы еще все стиралось до этих смсок (clear) возможно еще отцентровать но это так 50/50
        print(Fore.CYAN + "=" * 45)
        print(Fore.BLUE + f"⏱  Время потока продуктивности: {work} мин  ⏱")
        print(Fore.GREEN + f"       🌿  Время отдыха: {chill} мин  🌿")
        print(Fore.CYAN + "=" * 45)
        print()
        print(Fore.MAGENTA + f"🔥 Добро пожаловать, {name}, в сессию продуктивности 🔥") # будем запрашивать имя и записывать потом куда-то и брать его от туда
        print(Fore.WHITE + f"""
Выберите пункт и наслаждайтесь своей крутостью:

1 — Начать сессию
2 — Сменить время продуктивности
3 - Сменить время отдыха
4 — Я не {name}!
0 — Выйти
""")
        choice = input(Fore.LIGHTBLUE_EX + '>>> ' + Style.RESET_ALL)

        if choice == '1':
            print(Fore.GREEN + "🚀 Сессия началась! Вперёд к продуктивности!\n")
            # тут можно вставить вызов функции таймера
        elif choice == '2':
            work = input('На сколько по времени погружаемся в роботу: ')
        elif choice == '3':
            chill = input('Сколько отдыхаем: ')
        elif choice == '4':
            print('А стоп што, разве этот... я не для моего хозяйна создан?!')
            name = input(Fore.LIGHTBLUE_EX + '>>> ' + Style.RESET_ALL)
        elif choice == '0':
            print(Fore.RED + f'До встречи {name}^^  :)')
            break
        else:
            print('...')
